Revit 2027 API
BuiltInFailures.RebarFailures.PathShapeFailure Property
 Can't solve Rebar Shape in Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathShapeFailure { get; }
Public Shared ReadOnly Property PathShapeFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathShapeFailure {
	FailureDefinitionId^ get ();
}
static member PathShapeFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace